# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     3
#     -> 1

import random

N = 100
list = [random.randrange(1, 100) for _ in range(N)]

print(list)

X = int(input("Enter X: "))
count = 0
for i in list:
    if X == i:
        count += 1

print(count)