# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
#  Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, 
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, 
# если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
#  Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. 
# Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры.
#  В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# *Пример:*

# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
#     **Вывод:** Парам пам-пам 

str = "пара-ра-рам рам-пам-папам па-ра-па-да"
str = str.split()

def glass_count(phrase):
    set_gl = {"а", "о", "у", "е", "ы", "я", "и", "ю", "э"}
    return sum(map(phrase.count, set_gl))


print("Парам пам-пам" if len(set(map(glass_count, str))) == 1 else "Пам парам")
    