# Задача 6: Вы пользуетесь общественным транспортом? Вероятно,
# вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no

a = int(input("Enter the ticket number: "))

sum1 = a // 100000
a = a % 100000
sum1 += a // 10000
a = a % 10000
sum1 += a // 1000
a = a % 1000

sum2 = a // 100
a = a % 100
sum2 += a // 10 + a % 10

print("yes" if sum1 == sum2 else "no") 