# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

# *Пример:*

# 2 2
#     4 

a = int(input("Enter A: "))
b = int(input("Enter B: "))

def summ(a, b):
    if b == 1:
        return a + 1
    return summ(a, b - 1) + 1

print(summ(a, b))