# Два различных натуральных числа n и m называются дружественными, 
# если сумма делителей числа n (включая 1, но исключая само n) равна числу m и наоборот.
# Например, 220 и 284 – дружественные числа. По данному числу k выведите все пары дружественных чисел, 
# каждое из которых не превосходит k. Программа получает на вход одно натуральное число k, не превосходящее 105. 
# Программа должна вывести все пары дружественных чисел, каждое из которых не превосходит k. 
# Пары необходимо выводить по одной в строке, разделяя пробелами. Каждая пара должна быть выведена только один раз 
# (перестановка чисел новую пару не дает).
# Ввод: Вывод:
# 300 220 284
        
k = int(input("Enter K: "))
k1 = k * 3 ## может лучше словарь??

array = [0 for i in range(k1)]
array[0] = 0
array[1] = 1
array[2] = 1

def summ_d(n):                          ##Функция считает сумму делителей. 
    summa1 = 0                          ##Используется для чисел больше k
    for i in range(1, n // 2 + 1):
        if n % i == 0:
            summa1 += i
    return summa1

for i in range(3, k):                   ## Идея - не считать сумму делителей чисел i, состоящих из делителей, суммы которых уже известны
    summa = array[i]                   ## Сумма делителей iго числа изначально равно 0
    for j in range(i // 2 + 1, 0, -1): ## Начинаем искать делители с конца  10, 9, 8...
                                       ## Если j - делитель, то как обычно берем его в сумму делителей
        if i < j:                      ## Когда доходим до массива числе из array, ищем ближайший делитель который есть в массиве 
            if i % j == 0:             ## и берем сумму его делителей и его самого
                summa += array[j]      ## таким образом мы не повторяем поиск сумм, которые уже найдены
                break
        else:
            if i % j == 0: 
                summa += j
    array[i] = summa

for i in range(k):
    s1 = array[i]
    if s1 >= k:                         ## Мы же посчитали сумму делителей только для k элементов
        array[s1] = summ_d(s1)
    if i == array[s1] and i < s1:
        print(i, s1)