# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.
# s = x + y p = x * y p = sy - y2
# y2 - sy + p = 0 y = s - sqrt(s2-4p) / 2 x = sqrt(s2-4p) + s/2

s = int(input("Enter s"))
p = int(input("Enter p"))

print(((s ** 2 - 4 * p) ** (1/2) + s) / 2)
print((s - (s ** 2 - 4 * p) ** (1/2)) / 2)